<img src="AI2YOU.png">

<h1 align="center"><font size = 14>Machine Learning</font></h1>
<h4 align="center">March, 2023<h4>
<h3 align="center"><font size = 7>Pandas</font></h3>
<h1 align="center">Part1</h1>
<h4 align="center">P01V05</h4>
<br>
<h1 align="center"><font size = 6>AI2YOU | Zahra Amini</font></h1>
<br>
<br>
<br>
<br>
<br>

# Import Libraries

In [1]:
import numpy as np

import pandas as pd

# 1. Introduction to Pandas

### Series

In [2]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
type(obj)

pandas.core.series.Series

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj[0]

4

In [8]:
obj2['c']

3

In [9]:
obj2['d'] = 6

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[['d', 'c', 'a']]

d    6
c    3
a   -5
dtype: int64

In [12]:
obj2[obj2>3]

d    6
b    7
dtype: int64

In [13]:
obj2 * 3

d    18
b    21
a   -15
c     9
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

obj3 = pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']


obj4 = pd.Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
obj4.name = 'Population'

obj4.index.name = 'States'

obj4

States
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [23]:
numbers = [1, 2, None]

pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [24]:
np.nan == np.nan

False

In [25]:
np.isnan(np.nan)

True

### Data Frame

In [26]:
data = {"state": ["ohio", "ohio", "ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

In [27]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [29]:
frame.tail()

    state  year  pop
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [30]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [31]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [32]:
frame2

   year   state  pop debt
0  2000    ohio  1.5  NaN
1  2001    ohio  1.7  NaN
2  2002    ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [33]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [34]:
frame["state"]

0      ohio
1      ohio
2      ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [35]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [36]:
frame2.loc[1]

year     2001
state    ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [37]:
frame2.iloc[1]

year     2001
state    ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [38]:
frame2.loc[:, "year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [39]:
frame2.iloc[:, 0]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [40]:
frame2.loc[[1, 2], ["year", "state"]]

   year state
1  2001  ohio
2  2002  ohio

In [41]:
frame2.loc[frame2.year == 2001]

   year   state  pop debt
1  2001    ohio  1.7  NaN
3  2001  Nevada  2.4  NaN

In [42]:
frame2

   year   state  pop debt
0  2000    ohio  1.5  NaN
1  2001    ohio  1.7  NaN
2  2002    ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [43]:
frame2["debt"] = 16.5

In [44]:
frame2

   year   state  pop  debt
0  2000    ohio  1.5  16.5
1  2001    ohio  1.7  16.5
2  2002    ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [45]:
frame2["debt"] = np.arange(6.)

In [46]:
frame2

   year   state  pop  debt
0  2000    ohio  1.5   0.0
1  2001    ohio  1.7   1.0
2  2002    ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [47]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

frame2["debt"] = val

frame2

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.7   NaN
2  2002    ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [48]:
val = pd.Series([-1.2, -1.5, -1.7], index=[1, 2, 3])

frame2["debt"] = val

frame2

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.7  -1.2
2  2002    ohio  3.6  -1.5
3  2001  Nevada  2.4  -1.7
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [49]:
frame2["eas"] = frame2["state"]=="ohio"

frame2

   year   state  pop  debt    eas
0  2000    ohio  1.5   NaN   True
1  2001    ohio  1.7  -1.2   True
2  2002    ohio  3.6  -1.5   True
3  2001  Nevada  2.4  -1.7  False
4  2002  Nevada  2.9   NaN  False
5  2003  Nevada  3.2   NaN  False

In [50]:
del frame2["eas"]

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [51]:
frame2.drop(['debt'], axis=1)

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [52]:
frame2.drop([0, 3], axis=0)

   year   state  pop  debt
1  2001    ohio  1.7  -1.2
2  2002    ohio  3.6  -1.5
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [53]:
frame2.drop(columns = ['debt'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [54]:
frame2.drop(index=[2, 4, 5])

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.7  -1.2
3  2001  Nevada  2.4  -1.7

In [55]:
frame2.drop(index=[0], inplace=True)

In [56]:
frame2

   year   state  pop  debt
1  2001    ohio  1.7  -1.2
2  2002    ohio  3.6  -1.5
3  2001  Nevada  2.4  -1.7
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [57]:
obj3 = pd.Series(["blue", "pink", "yellow"], index=[0, 2, 4])
obj3

0      blue
2      pink
4    yellow
dtype: object

In [58]:
obj3.reindex(np.arange(6), method="bfill")

0      blue
1      pink
2      pink
3    yellow
4    yellow
5       NaN
dtype: object

In [59]:
frame.reindex(states, axis="columns")

   California  Ohio  Oregon  Texas
0         NaN   NaN     NaN    NaN
1         NaN   NaN     NaN    NaN
2         NaN   NaN     NaN    NaN
3         NaN   NaN     NaN    NaN
4         NaN   NaN     NaN    NaN
5         NaN   NaN     NaN    NaN

### 2. Querying Data Frame

In [60]:
frame2["pop"] < 5

1    True
2    True
3    True
4    True
5    True
Name: pop, dtype: bool

In [61]:
frame2[frame2["pop"] < 5]

   year   state  pop  debt
1  2001    ohio  1.7  -1.2
2  2002    ohio  3.6  -1.5
3  2001  Nevada  2.4  -1.7
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [62]:
frame2[frame2["debt"]> -1.5]

   year state  pop  debt
1  2001  ohio  1.7  -1.2

In [63]:
frame2.iloc[:, :3][frame2.year > 2001]

   year   state  pop
2  2002    ohio  3.6
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [64]:
frame2.loc[frame2.year >=2002]

   year   state  pop  debt
2  2002    ohio  3.6  -1.5
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

#### Read Dataset

In [65]:
df = pd.read_csv("Datasets/Admission_Predict.csv", index_col = 0)
df

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

In [66]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [67]:
df.columns = [x.lower().strip() for x in df.columns]

In [68]:
df.columns

Index(['gre score', 'toefl score', 'university rating', 'sop', 'lor', 'cgpa',
       'research', 'chance of admit'],
      dtype='object')

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 400 entries, 1 to 400
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   gre score          400 non-null    int64
 1   toefl score        400 non-null    int64
 2   university rating  400 non-null    int64
 3   sop                400 non-null    float64
 4   lor                400 non-null    float64
 5   cgpa               400 non-null    float64
 6   research           400 non-null    int64
 7   chance of admit    400 non-null    float64
dtypes: float64(4), int64(4)
memory usage: 28.1 KB

In [70]:
df[df['chance of admit']>0.7]

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...
395,329,111,4,4.5,4.0,9.23,1,0.89
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
400,333,117,4,5.0,4.0,9.66,1,0.95

In [71]:
admit_mask = df['chance of admit']>0.7
df.where(admit_mask)

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
396,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
397,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
398,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
399,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
400,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [72]:
df.where(admit_mask).isnull()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...
396,False,False,False,False,False,False,False,False
397,False,False,False,False,False,False,False,False
398,False,False,False,False,False,False,False,False
399,True,True,True,True,True,True,True,True
400,False,False,False,False,False,False,False,False

In [73]:
df.where(admit_mask).isnull().sum()

gre score            165
toefl score          165
university rating    165
sop                  165
lor                  165
cgpa                 165
research             165
chance of admit      165
dtype: int64

In [74]:
df.where(admit_mask).dropna()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
6,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90
...,...,...,...,...,...,...,...,...
395,329.0,111.0,4.0,4.5,4.0,9.23,1.0,0.89
396,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
397,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
398,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
400,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [75]:
df["gre score"]

Serial No.
1      337
2      324
3      316
4      322
5      314
      ...
396    324
397    325
398    330
399    312
400    333
Name: gre score, Length: 400, dtype: int64

In [76]:
df[["gre score", "toefl score"]]

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103
...               ...          ...
396               324          110
397               325          107
398               330          116
399               312          103
400               333          117

[400 rows x 2 columns]

In [77]:
df[df['gre score']>320].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90
7,321,109,3,3.0,4.0,8.20,1,0.75

In [78]:
df[((df['chance of admit']>0.7) & (df['chance of admit'] < 0.9))]

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
7,321,109,3,3.0,4.0,8.20,1,0.75
12,327,111,4,4.0,4.5,9.00,1,0.84
...,...,...,...,...,...,...,...,...
393,326,112,4,4.0,3.5,9.12,1,0.84
394,317,104,2,3.0,3.0,8.76,0,0.77
395,329,111,4,4.5,4.0,9.23,1,0.89
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84

In [79]:
df[((df['chance of admit'].gt(0.7)) & (df['chance of admit'].lt(0.9)))]

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
7,321,109,3,3.0,4.0,8.20,1,0.75
12,327,111,4,4.0,4.5,9.00,1,0.84
...,...,...,...,...,...,...,...,...
393,326,112,4,4.0,3.5,9.12,1,0.84
394,317,104,2,3.0,3.0,8.76,0,0.77
395,329,111,4,4.5,4.0,9.23,1,0.89
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84

# 3. Date Functionality

In [80]:
pd.Timestamp('9/1/2019 10:05PM')

Timestamp('2019-09-01 22:05:00')

In [81]:
pd.Timestamp(2019, 12, 20, 0, 0)

Timestamp('2019-12-20 00:00:00')

In [82]:
pd.Timestamp(2019, 12, 20, 0, 0).isoweekday()

5

In [83]:
d = pd.Timestamp(2019, 12, 20, 0, 0)

d.day_name()

'Friday'

In [84]:
pd.Timestamp(2019, 12, 20, 5, 2, 23).second

23

In [85]:
pd.Period('1/2016') + 5

Period('2016-06', 'M')

In [86]:
pd.Period('3/5/2016') - 3

Period('2016-03-02', 'D')

In [87]:
pd.Period('3/5/2016').day

5

In [88]:
t1 = pd.Series(list('abc'), [pd.Timestamp('2016-09-01'),
                            pd.Timestamp('2016-09-02'),
                            pd.Timestamp('2016-09-03')])

t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [89]:
list('abc')

['a', 'b', 'c']

In [90]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [91]:
t2 = pd.Series(list('abc'), [pd.Period('2016-09'),
                            pd.Period('2016-10'),
                            pd.Period('2016-11')])

t2

2016-09    a
2016-10    b
2016-11    c
Freq: M, dtype: object

In [92]:
type(t2.index)

pandas.core.indexes.period.PeriodIndex

### Converting to Datetime

In [93]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']

ts = pd.DataFrame(np.random.randint(10, 100, (4, 2)), index=d1, columns=list('ab'))

ts

               a   b
2 June 2013   35  31
Aug 29, 2014  54  93
2015-06-26    91  37
7/12/16       95  34

In [94]:
np.random.randint(10, 100, (4, 2))

array([[53, 35],
       [24, 30],
       [15, 14],
       [15, 88]])

In [95]:
ts.index = pd.to_datetime(ts.index)
ts

             a   b
2013-06-02  35  31
2014-08-29  54  93
2015-06-26  91  37
2016-07-12  95  34

In [96]:
pd.to_datetime('4.7.12', dayfirst=True)

Timestamp('2012-07-04 00:00:00')

In [97]:
pd.to_datetime('4.7.12', dayfirst=False)

Timestamp('2012-04-07 00:00:00')

### Timedelta

In [98]:
pd.Timestamp('9/3/2016') - pd.Timestamp('9/1/2016')

Timedelta('2 days 00:00:00')

In [99]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-09-14 11:10:00')

In [100]:
pd.Timestamp('9/4/2012') + pd.offsets.Week()

Timestamp('2012-09-11 00:00:00')

In [101]:
pd.Timestamp('2/4/2012') + pd.offsets.MonthEnd()

Timestamp('2012-02-29 00:00:00')

### Working with Dates in a Dataframe

In [102]:
dates = pd.date_range('10-01-2016', periods=9, freq='D')

dates

DatetimeIndex(['2016-10-01', '2016-10-02', '2016-10-03', '2016-10-04',
               '2016-10-05', '2016-10-06', '2016-10-07', '2016-10-08',
               '2016-10-09'],
              dtype='datetime64[ns]', freq='D')

In [103]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')

dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [104]:
pd.date_range('10-01-2016', periods=9, freq='B')

DatetimeIndex(['2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06',
               '2016-10-07', '2016-10-10', '2016-10-11', '2016-10-12',
               '2016-10-13'],
              dtype='datetime64[ns]', freq='B')

In [105]:
pd.Timestamp('10-01-2016').day_name()

'Saturday'

In [106]:
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [107]:
df = pd.DataFrame({'counts 1': 100+ np.random.randint(-5, 10, 9),
                   'counts 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)

In [108]:
df

            counts 1  counts 2
2016-10-02        95       121
2016-10-16       100       115
2016-10-30        99       128
2016-11-13       105       124
2016-11-27       100       122
2016-12-11       104       115
2016-12-25       103       118
2017-01-08       107       117
2017-01-22        99       123

In [109]:
df.diff()

            counts 1  counts 2
2016-10-02       NaN       NaN
2016-10-16       5.0      -6.0
2016-10-30      -1.0      13.0
2016-11-13       6.0      -4.0
2016-11-27      -5.0      -2.0
2016-12-11       4.0      -7.0
2016-12-25      -1.0       3.0
2017-01-08       4.0      -1.0
2017-01-22      -8.0       6.0

In [110]:
df.diff(axis=1)

            counts 1  counts 2
2016-10-02       NaN        26
2016-10-16       NaN        15
2016-10-30       NaN        29
2016-11-13       NaN        19
2016-11-27       NaN        22
2016-12-11       NaN        11
2016-12-25       NaN        15
2017-01-08       NaN        10
2017-01-22       NaN        24

In [111]:
df.resample('M').asfreq()

            counts 1  counts 2
2016-10-31       NaN       NaN
2016-11-30       NaN       NaN
2016-12-31       NaN       NaN
2017-01-31       NaN       NaN

In [112]:
df.resample('M').mean()

            counts 1    counts 2
2016-10-31      98.0  121.333333
2016-11-30     102.5  123.000000
2016-12-31     103.5  116.500000
2017-01-31     103.0  120.000000

In [113]:
df['2017']

C:\Users\amini\AppData\Local\Temp\ipykernel_11560\1797912031.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2017']

            counts 1  counts 2
2017-01-08       107       117
2017-01-22        99       123

In [114]:
df['2016-12']

C:\Users\amini\AppData\Local\Temp\ipykernel_11560\2391205231.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2016-12']

            counts 1  counts 2
2016-12-11       104       115
2016-12-25       103       118

In [115]:
df['2016-12':]

            counts 1  counts 2
2016-12-11       104       115
2016-12-25       103       118
2017-01-08       107       117
2017-01-22        99       123

In [116]:
df['2016']

C:\Users\amini\AppData\Local\Temp\ipykernel_11560\1903466119.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2016']

            counts 1  counts 2
2016-10-02        95       121
2016-10-16       100       115
2016-10-30        99       128
2016-11-13       105       124
2016-11-27       100       122
2016-12-11       104       115
2016-12-25       103       118

# Finished!

### Well Done!